{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Results\n",
    "\n",
    "This notebook is to view the dev_results when evaluating the model."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "PosixPath('/home/yjunteng/t5-for-sparql')"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import json\n",
    "import os\n",
    "from pathlib import Path\n",
    "import pandas as pd\n",
    "import re\n",
    "\n",
    "Path.cwd()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "path = Path(\"baseline\") / \"lcquad2\" / \"preprocessed_data.csv\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "baseline/lcquad2/small_train_new_mix_dev_result24000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result40000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n",
      "baseline/lcquad2/small_train_new_mix_dev_result56000.json\n"
     ]
    }
   ],
   "source": [
    "model_dict = {\n",
    "    \"small\": \"text2sparql-t5-small-lcquad2\",\n",
    "    \"base\": \"text2sparql-t5-base-lcquad2\",\n",
    "}\n",
    "\n",
    "model_key = \"small\"\n",
    "\n",
    "model_path = Path().cwd().joinpath('models').joinpath(model_dict[model_key])\n",
    "model_evals_dir = model_path.joinpath(\"evaluations\")\n",
    "model_evals_dir = Path(r\"baseline/lcquad2\")\n",
    "\n",
    "def retrieve_latest(path, regex):\n",
    "    latest = 0\n",
    "    res = None\n",
    "    for res_path in path.iterdir():\n",
    "        path_search = re.search(regex, res_path.name, re.IGNORECASE)\n",
    "        if path_search and int(path_search.group(1)) > latest:\n",
    "            latest = int(path_search.group(1))\n",
    "            res = res_path\n",
    "\n",
    "        print(res)\n",
    "    \n",
    "    return res\n",
    "\n",
    "latest_eval_path = retrieve_latest(model_evals_dir, r\"dev_result([0-9]+)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>input</th>\n",
       "      <th>gold</th>\n",
       "      <th>generated</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How was Leon Trotsky assassinated? &lt;extra_id_5...</td>\n",
       "      <td>&lt;extra_id_6&gt; &lt;extra_id_39&gt; &lt;extra_id_19&gt; &lt;extr...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What twinned administrative body of Norwich ha...</td>\n",
       "      <td>&lt;extra_id_6&gt; &lt;extra_id_39&gt; &lt;extra_id_19&gt; &lt;extr...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>What insecticide has the lowest combustion poi...</td>\n",
       "      <td>&lt;extra_id_6&gt; &lt;extra_id_39&gt; &lt;extra_id_19&gt; &lt;extr...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What is the capital city of the Kingdom of Nav...</td>\n",
       "      <td>&lt;extra_id_6&gt; &lt;extra_id_39&gt; &lt;extra_id_19&gt; &lt;extr...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which is the BirdLife International ID for Dod...</td>\n",
       "      <td>&lt;extra_id_6&gt; &lt;extra_id_21&gt; &lt;extra_id_39&gt; &lt;extr...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               input  \\\n",
       "0  How was Leon Trotsky assassinated? <extra_id_5...   \n",
       "1  What twinned administrative body of Norwich ha...   \n",
       "2  What insecticide has the lowest combustion poi...   \n",
       "3  What is the capital city of the Kingdom of Nav...   \n",
       "4  Which is the BirdLife International ID for Dod...   \n",
       "\n",
       "                                                gold  \\\n",
       "0  <extra_id_6> <extra_id_39> <extra_id_19> <extr...   \n",
       "1  <extra_id_6> <extra_id_39> <extra_id_19> <extr...   \n",
       "2  <extra_id_6> <extra_id_39> <extra_id_19> <extr...   \n",
       "3  <extra_id_6> <extra_id_39> <extra_id_19> <extr...   \n",
       "4  <extra_id_6> <extra_id_21> <extra_id_39> <extr...   \n",
       "\n",
       "                                           generated  \n",
       "0  <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "1  <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "2  <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "3  <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "4  <extra_id_6><extra_id_21><extra_id_39><extra_i...  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with open(latest_eval_path) as f:\n",
    "    latest_eval_json = json.load(f)\n",
    "df_raw = pd.DataFrame.from_records(latest_eval_json)\n",
    "df_raw.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>input</th>\n",
       "      <th>gold</th>\n",
       "      <th>generated</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How was Leon Trotsky assassinated? &lt;extra_id_5...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What twinned administrative body of Norwich ha...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>What insecticide has the lowest combustion poi...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What is the capital city of the Kingdom of Nav...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_39&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which is the BirdLife International ID for Dod...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2413</th>\n",
       "      <td>Who is the occupant of Liberal International? ...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2414</th>\n",
       "      <td>what is the start time for Rashi has residence...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_40&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_40&gt;&lt;extra_id_19&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2415</th>\n",
       "      <td>Of all the streak colors, how many are pink? &lt;...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_1&gt;&lt;extra_id_36&gt;&lt;extra_id...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_1&gt;&lt;extra_id_36&gt;&lt;extra_id...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2416</th>\n",
       "      <td>Who is the Head of State  of the Austrian Empi...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_21&gt;&lt;extra_id_39&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2417</th>\n",
       "      <td>When was Frederick Sanger awarded a Nobel Proz...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_40&gt;&lt;extra_id_41&gt;&lt;extra_i...</td>\n",
       "      <td>&lt;extra_id_6&gt;&lt;extra_id_40&gt;&lt;extra_id_41&gt;&lt;extra_i...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2418 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  input  \\\n",
       "0     How was Leon Trotsky assassinated? <extra_id_5...   \n",
       "1     What twinned administrative body of Norwich ha...   \n",
       "2     What insecticide has the lowest combustion poi...   \n",
       "3     What is the capital city of the Kingdom of Nav...   \n",
       "4     Which is the BirdLife International ID for Dod...   \n",
       "...                                                 ...   \n",
       "2413  Who is the occupant of Liberal International? ...   \n",
       "2414  what is the start time for Rashi has residence...   \n",
       "2415  Of all the streak colors, how many are pink? <...   \n",
       "2416  Who is the Head of State  of the Austrian Empi...   \n",
       "2417  When was Frederick Sanger awarded a Nobel Proz...   \n",
       "\n",
       "                                                   gold  \\\n",
       "0     <extra_id_6><extra_id_39><extra_id_19><extra_i...   \n",
       "1     <extra_id_6><extra_id_39><extra_id_19><extra_i...   \n",
       "2     <extra_id_6><extra_id_39><extra_id_19><extra_i...   \n",
       "3     <extra_id_6><extra_id_39><extra_id_19><extra_i...   \n",
       "4     <extra_id_6><extra_id_21><extra_id_39><extra_i...   \n",
       "...                                                 ...   \n",
       "2413  <extra_id_6><extra_id_21><extra_id_39><extra_i...   \n",
       "2414  <extra_id_6><extra_id_40><extra_id_19><extra_i...   \n",
       "2415  <extra_id_6><extra_id_1><extra_id_36><extra_id...   \n",
       "2416  <extra_id_6><extra_id_21><extra_id_39><extra_i...   \n",
       "2417  <extra_id_6><extra_id_40><extra_id_41><extra_i...   \n",
       "\n",
       "                                              generated  \n",
       "0     <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "1     <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "2     <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "3     <extra_id_6><extra_id_39><extra_id_19><extra_i...  \n",
       "4     <extra_id_6><extra_id_21><extra_id_39><extra_i...  \n",
       "...                                                 ...  \n",
       "2413  <extra_id_6><extra_id_21><extra_id_39><extra_i...  \n",
       "2414  <extra_id_6><extra_id_40><extra_id_19><extra_i...  \n",
       "2415  <extra_id_6><extra_id_1><extra_id_36><extra_id...  \n",
       "2416  <extra_id_6><extra_id_21><extra_id_39><extra_i...  \n",
       "2417  <extra_id_6><extra_id_40><extra_id_41><extra_i...  \n",
       "\n",
       "[2418 rows x 3 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_raw= df_raw.convert_dtypes()\n",
    "df_raw.gold = df_raw.gold.str.replace(\" \", \"\")\n",
    "df_raw.generated = df_raw.generated.str.replace(\" \", \"\")\n",
    "df_raw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_true = df_raw[df_raw[\"gold\"] == df_raw[\"generated\"]]\n",
    "df_false = df_raw[df_raw[\"gold\"] != df_raw[\"generated\"]]\n",
    "assert len(df_raw) == len(df_true) + len(df_false)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Gold: <extra_id_6><extra_id_39><extra_id_19><extra_id_33><extra_id_53>q861560<extra_id_54>p1995<extra_id_40><extra_id_38><extra_id_40><extra_id_54>p3095<extra_id_39><extra_id_15>\n",
      "Gene: <extra_id_6><extra_id_39><extra_id_19><extra_id_33><extra_id_53>q861560<extra_id_54>p3095<extra_id_40><extra_id_38><extra_id_40><extra_id_54>p1995<extra_id_39><extra_id_15>\n"
     ]
    }
   ],
   "source": [
    "print(f\"Gold: {df_false.gold.iloc[2]}\")\n",
    "print(f\"Gene: {df_false.generated.iloc[2]}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_23456/997597911.py:5: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  df_false.gold = df_false.loc[:, \"gold\"].apply(helper)\n",
      "/tmp/ipykernel_23456/997597911.py:6: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  df_false.generated = df_false.generated.apply(helper)\n"
     ]
    }
   ],
   "source": [
    "from src.sparql_processing import process_masked_query\n",
    "\n",
    "helper = lambda q: process_masked_query(q, Path(\"/home/yjunteng/t5-for-sparql/baseline/lcquad2/vocab.txt\"))\n",
    "\n",
    "df_false.gold = df_false.loc[:, \"gold\"].apply(helper)\n",
    "df_false.generated = df_false.generated.apply(helper)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def show(n: int):\n",
    "    print(f'Input: {df_false.input.iloc[n]}')\n",
    "    print(f'Gold: {df_false.gold.iloc[n]}')\n",
    "    print(f'Gene: {df_false.generated.iloc[n]}')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Input: What insecticide has the lowest combustion point? <extra_id_59> <extra_id_54>  p31 <extra_id_60>  <extra_id_59> <extra_id_53>  q181322 insecticide  <extra_id_59> <extra_id_54>  p31 <extra_id_60>  <extra_id_59> <extra_id_53>  q21073024 flammable solid  <extra_id_59> <extra_id_54>  p2107 <extra_id_60>\n",
      "Gold: select ?vr0 where { ?vr0 wdt: p31 wd: q21073024 . ?vr0 wdt: p2107 ?vr1 . ?vr0 wdt: p31 wd: q181322 } order by asc ( ?vr1 ) limit 5\n",
      "Gene: select ?vr0 where { ?vr0 wdt: p31 wd: q181322 . ?vr0 wdt: p2107 ?vr1 . ?vr0 wdt: p31 wd: q2107 } order by asc ( ?vr1 ) limit 5\n",
      "\n",
      "Input: What is the type of government of Saint Christopher in the Historical Period? <extra_id_59> <extra_id_54>  p122 <extra_id_60>  <extra_id_59> <extra_id_53>  q193507 Saint Christopher  <extra_id_59> <extra_id_54>  p2348 <extra_id_60>\n",
      "Gold: select ?vr0 where { wd: q193507 wdt: p2348 ?vr1 . ?vr1 wdt: p122 ?vr0 }\n",
      "Gene: select ?vr0 where { wd: q193507 wdt: p122 ?vr1 . ?vr1 wdt: p2348 ?vr0 }\n",
      "\n",
      "Input: What kind of specialty doctor diagnoses schizotypal personality disorder? <extra_id_59> <extra_id_54>  p1995 <extra_id_60>  <extra_id_59> <extra_id_53>  q861560 schizotypal personality disorder  <extra_id_59> <extra_id_54>  p3095 <extra_id_60>\n",
      "Gold: select ?vr0 where { wd: q861560 wdt: p1995 ?vr1 . ?vr1 wdt: p3095 ?vr0 }\n",
      "Gene: select ?vr0 where { wd: q861560 wdt: p3095 ?vr1 . ?vr1 wdt: p1995 ?vr0 }\n",
      "\n",
      "Input: how many records are held for pole vaulting? <extra_id_59> <extra_id_54>  p1000 <extra_id_60>  <extra_id_59> <extra_id_53>  q185027 pole vault\n",
      "Gold: select ( count ( ?vr0 ) as ?vr1 ) { ?vr0 wdt: p1000 wd: q185027 }\n",
      "Gene: select ( count ( ?vr0 ) as ?vr1 ) { wd: q185027 wdt: p1000 ?vr0 }\n",
      "\n",
      "Input: Which is the melting point of lindane? <extra_id_59> <extra_id_54>  p2101 <extra_id_60>  <extra_id_59> <extra_id_53>  q282003 lindane\n",
      "Gold: select distinct ?vr0 where { wd: q282003 wdt: p2101 ?vr0 }\n",
      "Gene: select distinct ?vr0 where { ?vr0 wdt: p2101 wd: q282003 }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for x in [0, 1, 2, 3, 10]:\n",
    "    show(x)\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Input: In which time zone is Newcastle upon Tyne located? <extra_id_59> <extra_id_53>  q1425428 Newcastle upon Tyne  <extra_id_59> <extra_id_53>  q6655 UTC+01:00  <extra_id_59>  <extra_id_56>  p421 located in time zone  <extra_id_59>  <extra_id_55>  p421 located in time zone  <extra_id_59> <extra_id_57>  p1264 valid in period\n",
      "Gold: select ?vr1 where { wd: q1425428 p: p421 ?vr0 . ?vr0 ps: p421 wd: q6655 . ?vr0 pq: p1264 ?vr1 }\n",
      "Gene: select ?vr0 where { wd: q1425428 p: p421 ?vr1 . ?vr1 ps: p421 ?vr0 . ?vr1 pq: p1264 wd: q6655 }\n",
      "\n",
      "Input: In what branch of Chemistry would you study the properties of peat? <extra_id_59> <extra_id_53>  q184624 peat  <extra_id_59> <extra_id_53>  q11790203 branch of chemistry  <extra_id_59> <extra_id_54>  p2578 studies  <extra_id_59> <extra_id_54>  p31 instance of\n",
      "Gold: select distinct ?vr0 where { ?vr0 wdt: p2578 wd: q184624 . ?vr0 wdt: p31 wd: q11790203 }\n",
      "Gene: select distinct ?vr0 where { wd: q184624 wdt: p2578 ?vr0 . ?vr0 wdt: p31 wd: q11790203 }\n",
      "\n",
      "Input: What movie is named after Denzel Washington? <extra_id_59> <extra_id_53>  q42101 Denzel Washington  <extra_id_59> <extra_id_53>  q1371849 filmography  <extra_id_59> <extra_id_54>  p138 named after  <extra_id_59> <extra_id_54>  p31 instance of\n",
      "Gold: select distinct ?vr0 where { ?vr0 wdt: p138 wd: q42101 . ?vr0 wdt: p31 wd: q1371849 }\n",
      "Gene: select distinct ?vr0 where { wd: q42101 wdt: p138 ?vr0 . ?vr0 wdt: p31 wd: q1371849 }\n",
      "\n",
      "Input: What is tourist office for  office ? <extra_id_59> <extra_id_53>  q182060 office  <extra_id_59> <extra_id_54>  p2872 visitor centre\n",
      "Gold: select distinct ?vr0 where { ?vr0 wdt: p2872 wd: q182060 }\n",
      "Gene: select distinct ?vr0 where { wd: q182060 wdt: p2872 ?vr0 }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for x in range(6, 10):\n",
    "    show(x)\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Input: Which is the melting point of lindane? <extra_id_59> <extra_id_54>  p2101 <extra_id_60>  <extra_id_59> <extra_id_53>  q282003 lindane\n",
      "Gold: select distinct ?vr0 where { wd: q282003 wdt: p2101 ?vr0 }\n",
      "Gene: select distinct ?vr0 where { ?vr0 wdt: p2101 wd: q282003 }\n",
      "\n",
      "Input: Which kind of weather caused by coldburst contains the word \"rain\" in its name ? <extra_id_59> <extra_id_54>  p31 <extra_id_60>  <extra_id_59> <extra_id_54>  p828 <extra_id_60>  <extra_id_59> <extra_id_53>  q1292121 shower  <extra_id_59> <extra_id_53>  q11663 weather\n",
      "Gold: select distinct ?vr0 ?vr0_label where { ?vr0 wdt: p31 wd: q11663 . ?vr0 wdt: p828 wd: q1292121 . ?vr0 rdfs:label ?vr0_label . filter ( contains ( lcase ( ?vr0_label ) , ' rain ' ) ) . filter ( lang ( ?vr0_label ) = ' en ' ) } limit 25\n",
      "Gene: select distinct ?vr0 ?vr0_label where { ?vr0 wdt: p31 wd: q1292121 . ?vr0 wdt: p828 wd: q11663 . ?vr0 rdfs:label ?vr0_label . filter ( contains ( lcase ( ?vr0_label ) , ' rain ' ) ) . filter ( lang ( ?vr0_label ) = ' en ' ) } limit 25\n",
      "\n",
      "Input: Name the country associated with Himachal Pradesh. <extra_id_59> <extra_id_54>  p31 <extra_id_60>  <extra_id_59> <extra_id_53>  q1177 Himachal Pradesh  <extra_id_59> <extra_id_53>  q6256 country  <extra_id_59> <extra_id_54>  p17 <extra_id_60>\n",
      "Gold: select distinct ?vr0 where { wd: q1177 wdt: p17 ?vr0 . ?vr0 wdt: p31 wd: q6256 }\n",
      "Gene: select distinct ?vr0 where { ?vr0 wdt: p17 wd: q1177 . ?vr0 wdt: p31 wd: q6256 }\n",
      "\n",
      "Input: What sovereign state belonging to the International Finance Corporation has the lowest unemployment rate? <extra_id_59> <extra_id_54>  p1198 <extra_id_60>  <extra_id_59> <extra_id_54>  p31 <extra_id_60>  <extra_id_59> <extra_id_53>  q656801 International Finance Corporation  <extra_id_59> <extra_id_54>  p463 <extra_id_60>  <extra_id_59> <extra_id_53>  q3624078 sovereign state\n",
      "Gold: select ?vr0 where { ?vr0 wdt: p31 wd: q3624078 . ?vr0 wdt: p1198 ?vr1 . ?vr0 wdt: p463 wd: q656801 } order by asc ( ?vr1 ) limit 5\n",
      "Gene: select ?vr0 where { ?vr0 wdt: p31 wd: q3624078 . ?vr0 wdt: p1198 ?vr1 . ?vr0 wdt: p463 wd: q656801 . } order by asc ( ?vr1 ) limit 5\n",
      "\n",
      "Input: What is plays of Axl Rose Fernando that has discovered is Bartolomeo Cristofori? <extra_id_59> <extra_id_53>  q11885 Axl Rose  <extra_id_59> <extra_id_54>  p1303 <extra_id_60>  <extra_id_59> <extra_id_54>  p61 <extra_id_60>  <extra_id_59> <extra_id_53>  q301597 Bartolomeo Cristofori\n",
      "Gold: select ?vr0 where { wd: q11885 wdt: p1303 ?vr0 . ?vr0 wdt: p61 wd: q301597 }\n",
      "Gene: select ?vr0 where { wd: q11885 wdt: p61 ?vr0 . ?vr0 wdt: p1303 wd: q301597 }\n",
      "\n",
      "Input: When did the Pridnestrovian Moldavian Republic have the head of state of Yevgeny Shevchuk? <extra_id_59>  <extra_id_56>  p35 <extra_id_60>  <extra_id_59> <extra_id_57>  p39 <extra_id_60>  <extra_id_59> <extra_id_53>  q907112 Transnistria  <extra_id_59> <extra_id_53>  q188409 Yevgeny Shevchuk  <extra_id_59>  <extra_id_55>  p35 <extra_id_60>\n",
      "Gold: select ?vr1 where { wd: q907112 p: p35 ?vr0 . ?vr0 ps: p35 wd: q188409 . ?vr0 pq: p39 ?vr1 }\n",
      "Gene: select ?vr1 where { wd: q188409 p: p35 ?vr0 . ?vr0 ps: p35 wd: q907112 . ?vr0 pq: p39 ?vr1 }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for x in range(10,16):\n",
    "    show(x)\n",
    "    print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "py310",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
